app/controllers/comments_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]
INSERT INTO "comments" ("user_id", "body", "rating", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 4], ["body", "Great bike !"], ["rating", 5], ["product_id", 29], ["created_at", "2018-09-26 06:39:33.027881"], ["updated_at", "2018-09-26 06:39:33.027881"]]
---
	def create
		@product = Product.find(params[:product_id])
  	@comment = @product.comments.new(comment_params)
  	@comment.user = current_user
  	@comment.save