app/controllers/orders_controller.rb

  def index
    @orders = Order.includes(:product).all
---
SELECT "orders".* FROM "orders"
SELECT "products".* FROM "products" WHERE "products"."id" IN (2, 3)