app/controllers/products_controller.rb

  def index
    if params[:q]
      search_term = params[:q]
      @products = Product.search(search_term)
---
SELECT "products".* FROM "products" WHERE (name LIKE '%velo 2%')

  def show
    @comments = @product.comments.order("created_at DESC")
---
SELECT "comments".* FROM "comments" WHERE "comments"."product_id" = ? ORDER BY created_at DESC  [["product_id", 29]]

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "description", "image_url", "created_at", "updated_at", "color", "price") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Wonderbike"], ["description", "Wouou"], ["image_url", ""], ["created_at", "2018-03-15 14:15:02.325343"], ["updated_at", "2018-03-15 14:15:02.325343"], ["color", "Red"], ["price", 567]]

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "image_url" = ?, "color" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["image_url", "https://media.alltricks.com/hd/5799c71d0f88a.jpg"], ["color", ""], ["updated_at", "2018-03-07 13:19:00.151654"], ["id", 4]]