app/controllers/simple_pages_controller.rb

SELECT  "products".* FROM "products" ORDER BY "products"."id" DESC LIMIT ?  [["LIMIT", 3]]
---
	def landing_page
    @featured_product = Product.first